xiongGithub1/bootMin/MCAL364/TC36xA/_Reg/IfxGeth_bf.h
/** \brief Offset for Ifx_GETH_MMC_TX_INTERRUPT_MASK_Bits.TXLPITRCIM */
#define IFX_GETH_MMC_TX_INTERRUPT_MASK_TXLPITRCIM_OFF (27u)

/** \brief Length for Ifx_GETH_TX_OCTET_COUNT_GOOD_BAD_Bits.TXOCTGB */
#define IFX_GETH_TX_OCTET_COUNT_GOOD_BAD_TXOCTGB_LEN (32u)

/** \brief Mask for Ifx_GETH_TX_OCTET_COUNT_GOOD_BAD_Bits.TXOCTGB */
#define IFX_GETH_TX_OCTET_COUNT_GOOD_BAD_TXOCTGB_MSK (0xffffffffu)

/** \brief Offset for Ifx_GETH_TX_OCTET_COUNT_GOOD_BAD_Bits.TXOCTGB */
#define IFX_GETH_TX_OCTET_COUNT_GOOD_BAD_TXOCTGB_OFF (0u)

/** \brief Length for Ifx_GETH_TX_PACKET_COUNT_GOOD_BAD_Bits.TXPKTGB */
#define IFX_GETH_TX_PACKET_COUNT_GOOD_BAD_TXPKTGB_LEN (16u)

/** \brief Mask for Ifx_GETH_TX_PACKET_COUNT_GOOD_BAD_Bits.TXPKTGB */
#define IFX_GETH_TX_PACKET_COUNT_GOOD_BAD_TXPKTGB_MSK (0xffffu)

/** \brief Offset for Ifx_GETH_TX_PACKET_COUNT_GOOD_BAD_Bits.TXPKTGB */
#define IFX_GETH_TX_PACKET_COUNT_GOOD_BAD_TXPKTGB_OFF (0u)

/** \brief Length for Ifx_GETH_TX_BROADCAST_PACKETS_GOOD_Bits.TXBCASTG */
#define IFX_GETH_TX_BROADCAST_PACKETS_GOOD_TXBCASTG_LEN (16u)

/** \brief Mask for Ifx_GETH_TX_BROADCAST_PACKETS_GOOD_Bits.TXBCASTG */
#define IFX_GETH_TX_BROADCAST_PACKETS_GOOD_TXBCASTG_MSK (0xffffu)

/** \brief Offset for Ifx_GETH_TX_BROADCAST_PACKETS_GOOD_Bits.TXBCASTG */
#define IFX_GETH_TX_BROADCAST_PACKETS_GOOD_TXBCASTG_OFF (0u)

/** \brief Length for Ifx_GETH_TX_MULTICAST_PACKETS_GOOD_Bits.TXMCASTG */
#define IFX_GETH_TX_MULTICAST_PACKETS_GOOD_TXMCASTG_LEN (16u)

/** \brief Mask for Ifx_GETH_TX_MULTICAST_PACKETS_GOOD_Bits.TXMCASTG */
#define IFX_GETH_TX_MULTICAST_PACKETS_GOOD_TXMCASTG_MSK (0xffffu)

/** \brief Offset for Ifx_GETH_TX_MULTICAST_PACKETS_GOOD_Bits.TXMCASTG */
#define IFX_GETH_TX_MULTICAST_PACKETS_GOOD_TXMCASTG_OFF (0u)

/** \brief Length for Ifx_GETH_TX_64OCTETS_PACKETS_GOOD_BAD_Bits.TX64OCTGB */
#define IFX_GETH_TX_64OCTETS_PACKETS_GOOD_BAD_TX64OCTGB_LEN (16u)

/** \brief Mask for Ifx_GETH_TX_64OCTETS_PACKETS_GOOD_BAD_Bits.TX64OCTGB */
#define IFX_GETH_TX_64OCTETS_PACKETS_GOOD_BAD_TX64OCTGB_MSK (0xffffu)

/** \brief Offset for Ifx_GETH_TX_64OCTETS_PACKETS_GOOD_BAD_Bits.TX64OCTGB */
#define IFX_GETH_TX_64OCTETS_PACKETS_GOOD_BAD_TX64OCTGB_OFF (0u)

/** \brief Length for Ifx_GETH_TX_65TO127OCTETS_PACKETS_GOOD_BAD_Bits.TX65_127OCTGB */
#define IFX_GETH_TX_65TO127OCTETS_PACKETS_GOOD_BAD_TX65_127OCTGB_LEN (16u)

/** \brief Mask for Ifx_GETH_TX_65TO127OCTETS_PACKETS_GOOD_BAD_Bits.TX65_127OCTGB */
#define IFX_GETH_TX_65TO127OCTETS_PACKETS_GOOD_BAD_TX65_127OCTGB_MSK (0xffffu)

/** \brief Offset for Ifx_GETH_TX_65TO127OCTETS_PACKETS_GOOD_BAD_Bits.TX65_127OCTGB */
#define IFX_GETH_TX_65TO127OCTETS_PACKETS_GOOD_BAD_TX65_127OCTGB_OFF (0u)

/** \brief Length for Ifx_GETH_TX_128TO255OCTETS_PACKETS_GOOD_BAD_Bits.TX128_255OCTGB */
#define IFX_GETH_TX_128TO255OCTETS_PACKETS_GOOD_BAD_TX128_255OCTGB_LEN (16u)

/** \brief Mask for Ifx_GETH_TX_128TO255OCTETS_PACKETS_GOOD_BAD_Bits.TX128_255OCTGB */
#define IFX_GETH_TX_128TO255OCTETS_PACKETS_GOOD_BAD_TX128_255OCTGB_MSK (0xffffu)

/** \brief Offset for Ifx_GETH_TX_128TO255OCTETS_PACKETS_GOOD_BAD_Bits.TX128_255OCTGB */
#define IFX_GETH_TX_128TO255OCTETS_PACKETS_GOOD_BAD_TX128_255OCTGB_OFF (0u)

/** \brief Length for Ifx_GETH_TX_256TO511OCTETS_PACKETS_GOOD_BAD_Bits.TX256_511OCTGB */
#define IFX_GETH_TX_256TO511OCTETS_PACKETS_GOOD_BAD_TX256_511OCTGB_LEN (16u)

/** \brief Mask for Ifx_GETH_TX_256TO511OCTETS_PACKETS_GOOD_BAD_Bits.TX256_511OCTGB */
#define IFX_GETH_TX_256TO511OCTETS_PACKETS_GOOD_BAD_TX256_511OCTGB_MSK (0xffffu)

/** \brief Offset for Ifx_GETH_TX_256TO511OCTETS_PACKETS_GOOD_BAD_Bits.TX256_511OCTGB */
#define IFX_GETH_TX_256TO511OCTETS_PACKETS_GOOD_BAD_TX256_511OCTGB_OFF (0u)

/** \brief Length for Ifx_GETH_TX_512TO1023OCTETS_PACKETS_GOOD_BAD_Bits.TX512_1023OCTGB */
#define IFX_GETH_TX_512TO1023OCTETS_PACKETS_GOOD_BAD_TX512_1023OCTGB_LEN (16u)

/** \brief Mask for Ifx_GETH_TX_512TO1023OCTETS_PACKETS_GOOD_BAD_Bits.TX512_1023OCTGB */
#define IFX_GETH_TX_512TO1023OCTETS_PACKETS_GOOD_BAD_TX512_1023OCTGB_MSK (0xffffu)

/** \brief Offset for Ifx_GETH_TX_512TO1023OCTETS_PACKETS_GOOD_BAD_Bits.TX512_1023OCTGB */
#define IFX_GETH_TX_512TO1023OCTETS_PACKETS_GOOD_BAD_TX512_1023OCTGB_OFF (0u)

/** \brief Length for Ifx_GETH_TX_1024TOMAXOCTETS_PACKETS_GOOD_BAD_Bits.TX1024_MAXOCTGB */
#define IFX_GETH_TX_1024TOMAXOCTETS_PACKETS_GOOD_BAD_TX1024_MAXOCTGB_LEN (16u)

/** \brief Mask for Ifx_GETH_TX_1024TOMAXOCTETS_PACKETS_GOOD_BAD_Bits.TX1024_MAXOCTGB */
#define IFX_GETH_TX_1024TOMAXOCTETS_PACKETS_GOOD_BAD_TX1024_MAXOCTGB_MSK (0xffffu)

/** \brief Offset for Ifx_GETH_TX_1024TOMAXOCTETS_PACKETS_GOOD_BAD_Bits.TX1024_MAXOCTGB */
#define IFX_GETH_TX_1024TOMAXOCTETS_PACKETS_GOOD_BAD_TX1024_MAXOCTGB_OFF (0u)

/** \brief Length for Ifx_GETH_TX_UNICAST_PACKETS_GOOD_BAD_Bits.TXUCASTGB */
#define IFX_GETH_TX_UNICAST_PACKETS_GOOD_BAD_TXUCASTGB_LEN (16u)

/** \brief Mask for Ifx_GETH_TX_UNICAST_PACKETS_GOOD_BAD_Bits.TXUCASTGB */
#define IFX_GETH_TX_UNICAST_PACKETS_GOOD_BAD_TXUCASTGB_MSK (0xffffu)

/** \brief Offset for Ifx_GETH_TX_UNICAST_PACKETS_GOOD_BAD_Bits.TXUCASTGB */
#define IFX_GETH_TX_UNICAST_PACKETS_GOOD_BAD_TXUCASTGB_OFF (0u)

/** \brief Length for Ifx_GETH_TX_MULTICAST_PACKETS_GOOD_BAD_Bits.TXMCASTGB */
#define IFX_GETH_TX_MULTICAST_PACKETS_GOOD_BAD_TXMCASTGB_LEN (16u)

/** \brief Mask for Ifx_GETH_TX_MULTICAST_PACKETS_GOOD_BAD_Bits.TXMCASTGB */
#define IFX_GETH_TX_MULTICAST_PACKETS_GOOD_BAD_TXMCASTGB_MSK (0xffffu)

/** \brief Offset for Ifx_GETH_TX_MULTICAST_PACKETS_GOOD_BAD_Bits.TXMCASTGB */
#define IFX_GETH_TX_MULTICAST_PACKETS_GOOD_BAD_TXMCASTGB_OFF (0u)

/** \brief Length for Ifx_GETH_TX_BROADCAST_PACKETS_GOOD_BAD_Bits.TXBCASTGB */
#define IFX_GETH_TX_BROADCAST_PACKETS_GOOD_BAD_TXBCASTGB_LEN (16u)

/** \brief Mask for Ifx_GETH_TX_BROADCAST_PACKETS_GOOD_BAD_Bits.TXBCASTGB */
#define IFX_GETH_TX_BROADCAST_PACKETS_GOOD_BAD_TXBCASTGB_MSK (0xffffu)

/** \brief Offset for Ifx_GETH_TX_BROADCAST_PACKETS_GOOD_BAD_Bits.TXBCASTGB */
#define IFX_GETH_TX_BROADCAST_PACKETS_GOOD_BAD_TXBCASTGB_OFF (0u)

/** \brief Length for Ifx_GETH_TX_UNDERFLOW_ERROR_PACKETS_Bits.TXUNDRFLW */
#define IFX_GETH_TX_UNDERFLOW_ERROR_PACKETS_TXUNDRFLW_LEN (16u)

/** \brief Mask for Ifx_GETH_TX_UNDERFLOW_ERROR_PACKETS_Bits.TXUNDRFLW */
#define IFX_GETH_TX_UNDERFLOW_ERROR_PACKETS_TXUNDRFLW_MSK (0xffffu)

