xiongGithub1/bootMin/MCAL364/TC36xA/_Reg/IfxGeth_bf.h
/** \brief Length for Ifx_GETH_MMC_IPC_RX_INTERRUPT_Bits.RXUDPGPIS */
#define IFX_GETH_MMC_IPC_RX_INTERRUPT_RXUDPGPIS_LEN (1u)

/** \brief Mask for Ifx_GETH_MMC_IPC_RX_INTERRUPT_Bits.RXUDPGPIS */
#define IFX_GETH_MMC_IPC_RX_INTERRUPT_RXUDPGPIS_MSK (0x1u)

/** \brief Offset for Ifx_GETH_MMC_IPC_RX_INTERRUPT_Bits.RXUDPGPIS */
#define IFX_GETH_MMC_IPC_RX_INTERRUPT_RXUDPGPIS_OFF (8u)

/** \brief Length for Ifx_GETH_MMC_IPC_RX_INTERRUPT_Bits.RXUDPERPIS */
#define IFX_GETH_MMC_IPC_RX_INTERRUPT_RXUDPERPIS_LEN (1u)

/** \brief Mask for Ifx_GETH_MMC_IPC_RX_INTERRUPT_Bits.RXUDPERPIS */
#define IFX_GETH_MMC_IPC_RX_INTERRUPT_RXUDPERPIS_MSK (0x1u)

/** \brief Offset for Ifx_GETH_MMC_IPC_RX_INTERRUPT_Bits.RXUDPERPIS */
#define IFX_GETH_MMC_IPC_RX_INTERRUPT_RXUDPERPIS_OFF (9u)

/** \brief Length for Ifx_GETH_MMC_IPC_RX_INTERRUPT_Bits.RXTCPGPIS */
#define IFX_GETH_MMC_IPC_RX_INTERRUPT_RXTCPGPIS_LEN (1u)

/** \brief Mask for Ifx_GETH_MMC_IPC_RX_INTERRUPT_Bits.RXTCPGPIS */
#define IFX_GETH_MMC_IPC_RX_INTERRUPT_RXTCPGPIS_MSK (0x1u)

/** \brief Offset for Ifx_GETH_MMC_IPC_RX_INTERRUPT_Bits.RXTCPGPIS */
#define IFX_GETH_MMC_IPC_RX_INTERRUPT_RXTCPGPIS_OFF (10u)

/** \brief Length for Ifx_GETH_MMC_IPC_RX_INTERRUPT_Bits.RXTCPERPIS */
#define IFX_GETH_MMC_IPC_RX_INTERRUPT_RXTCPERPIS_LEN (1u)

/** \brief Mask for Ifx_GETH_MMC_IPC_RX_INTERRUPT_Bits.RXTCPERPIS */
#define IFX_GETH_MMC_IPC_RX_INTERRUPT_RXTCPERPIS_MSK (0x1u)

/** \brief Offset for Ifx_GETH_MMC_IPC_RX_INTERRUPT_Bits.RXTCPERPIS */
#define IFX_GETH_MMC_IPC_RX_INTERRUPT_RXTCPERPIS_OFF (11u)

/** \brief Length for Ifx_GETH_MMC_IPC_RX_INTERRUPT_Bits.RXICMPGPIS */
#define IFX_GETH_MMC_IPC_RX_INTERRUPT_RXICMPGPIS_LEN (1u)

/** \brief Mask for Ifx_GETH_MMC_IPC_RX_INTERRUPT_Bits.RXICMPGPIS */
#define IFX_GETH_MMC_IPC_RX_INTERRUPT_RXICMPGPIS_MSK (0x1u)

/** \brief Offset for Ifx_GETH_MMC_IPC_RX_INTERRUPT_Bits.RXICMPGPIS */
#define IFX_GETH_MMC_IPC_RX_INTERRUPT_RXICMPGPIS_OFF (12u)

/** \brief Length for Ifx_GETH_MMC_IPC_RX_INTERRUPT_Bits.RXICMPERPIS */
#define IFX_GETH_MMC_IPC_RX_INTERRUPT_RXICMPERPIS_LEN (1u)

/** \brief Mask for Ifx_GETH_MMC_IPC_RX_INTERRUPT_Bits.RXICMPERPIS */
#define IFX_GETH_MMC_IPC_RX_INTERRUPT_RXICMPERPIS_MSK (0x1u)

/** \brief Offset for Ifx_GETH_MMC_IPC_RX_INTERRUPT_Bits.RXICMPERPIS */
#define IFX_GETH_MMC_IPC_RX_INTERRUPT_RXICMPERPIS_OFF (13u)

/** \brief Length for Ifx_GETH_MMC_IPC_RX_INTERRUPT_Bits.RXIPV4GOIS */
#define IFX_GETH_MMC_IPC_RX_INTERRUPT_RXIPV4GOIS_LEN (1u)

/** \brief Mask for Ifx_GETH_MMC_IPC_RX_INTERRUPT_Bits.RXIPV4GOIS */
#define IFX_GETH_MMC_IPC_RX_INTERRUPT_RXIPV4GOIS_MSK (0x1u)

/** \brief Offset for Ifx_GETH_MMC_IPC_RX_INTERRUPT_Bits.RXIPV4GOIS */
#define IFX_GETH_MMC_IPC_RX_INTERRUPT_RXIPV4GOIS_OFF (16u)

/** \brief Length for Ifx_GETH_MMC_IPC_RX_INTERRUPT_Bits.RXIPV4HEROIS */
#define IFX_GETH_MMC_IPC_RX_INTERRUPT_RXIPV4HEROIS_LEN (1u)

/** \brief Mask for Ifx_GETH_MMC_IPC_RX_INTERRUPT_Bits.RXIPV4HEROIS */
#define IFX_GETH_MMC_IPC_RX_INTERRUPT_RXIPV4HEROIS_MSK (0x1u)

/** \brief Offset for Ifx_GETH_MMC_IPC_RX_INTERRUPT_Bits.RXIPV4HEROIS */
#define IFX_GETH_MMC_IPC_RX_INTERRUPT_RXIPV4HEROIS_OFF (17u)

/** \brief Length for Ifx_GETH_MMC_IPC_RX_INTERRUPT_Bits.RXIPV4NOPAYOIS */
#define IFX_GETH_MMC_IPC_RX_INTERRUPT_RXIPV4NOPAYOIS_LEN (1u)

/** \brief Mask for Ifx_GETH_MMC_IPC_RX_INTERRUPT_Bits.RXIPV4NOPAYOIS */
#define IFX_GETH_MMC_IPC_RX_INTERRUPT_RXIPV4NOPAYOIS_MSK (0x1u)

/** \brief Offset for Ifx_GETH_MMC_IPC_RX_INTERRUPT_Bits.RXIPV4NOPAYOIS */
#define IFX_GETH_MMC_IPC_RX_INTERRUPT_RXIPV4NOPAYOIS_OFF (18u)

/** \brief Length for Ifx_GETH_MMC_IPC_RX_INTERRUPT_Bits.RXIPV4FRAGOIS */
#define IFX_GETH_MMC_IPC_RX_INTERRUPT_RXIPV4FRAGOIS_LEN (1u)

/** \brief Mask for Ifx_GETH_MMC_IPC_RX_INTERRUPT_Bits.RXIPV4FRAGOIS */
#define IFX_GETH_MMC_IPC_RX_INTERRUPT_RXIPV4FRAGOIS_MSK (0x1u)

/** \brief Offset for Ifx_GETH_MMC_IPC_RX_INTERRUPT_Bits.RXIPV4FRAGOIS */
#define IFX_GETH_MMC_IPC_RX_INTERRUPT_RXIPV4FRAGOIS_OFF (19u)

/** \brief Length for Ifx_GETH_MMC_IPC_RX_INTERRUPT_Bits.RXIPV4UDSBLOIS */
#define IFX_GETH_MMC_IPC_RX_INTERRUPT_RXIPV4UDSBLOIS_LEN (1u)

/** \brief Mask for Ifx_GETH_MMC_IPC_RX_INTERRUPT_Bits.RXIPV4UDSBLOIS */
#define IFX_GETH_MMC_IPC_RX_INTERRUPT_RXIPV4UDSBLOIS_MSK (0x1u)

/** \brief Offset for Ifx_GETH_MMC_IPC_RX_INTERRUPT_Bits.RXIPV4UDSBLOIS */
#define IFX_GETH_MMC_IPC_RX_INTERRUPT_RXIPV4UDSBLOIS_OFF (20u)

/** \brief Length for Ifx_GETH_MMC_IPC_RX_INTERRUPT_Bits.RXIPV6GOIS */
#define IFX_GETH_MMC_IPC_RX_INTERRUPT_RXIPV6GOIS_LEN (1u)

/** \brief Mask for Ifx_GETH_MMC_IPC_RX_INTERRUPT_Bits.RXIPV6GOIS */
#define IFX_GETH_MMC_IPC_RX_INTERRUPT_RXIPV6GOIS_MSK (0x1u)

/** \brief Offset for Ifx_GETH_MMC_IPC_RX_INTERRUPT_Bits.RXIPV6GOIS */
#define IFX_GETH_MMC_IPC_RX_INTERRUPT_RXIPV6GOIS_OFF (21u)

/** \brief Length for Ifx_GETH_MMC_IPC_RX_INTERRUPT_Bits.RXIPV6HEROIS */
#define IFX_GETH_MMC_IPC_RX_INTERRUPT_RXIPV6HEROIS_LEN (1u)

/** \brief Mask for Ifx_GETH_MMC_IPC_RX_INTERRUPT_Bits.RXIPV6HEROIS */
#define IFX_GETH_MMC_IPC_RX_INTERRUPT_RXIPV6HEROIS_MSK (0x1u)

/** \brief Offset for Ifx_GETH_MMC_IPC_RX_INTERRUPT_Bits.RXIPV6HEROIS */
#define IFX_GETH_MMC_IPC_RX_INTERRUPT_RXIPV6HEROIS_OFF (22u)

/** \brief Length for Ifx_GETH_MMC_IPC_RX_INTERRUPT_Bits.RXIPV6NOPAYOIS */
#define IFX_GETH_MMC_IPC_RX_INTERRUPT_RXIPV6NOPAYOIS_LEN (1u)

/** \brief Mask for Ifx_GETH_MMC_IPC_RX_INTERRUPT_Bits.RXIPV6NOPAYOIS */
#define IFX_GETH_MMC_IPC_RX_INTERRUPT_RXIPV6NOPAYOIS_MSK (0x1u)

/** \brief Offset for Ifx_GETH_MMC_IPC_RX_INTERRUPT_Bits.RXIPV6NOPAYOIS */
#define IFX_GETH_MMC_IPC_RX_INTERRUPT_RXIPV6NOPAYOIS_OFF (23u)

/** \brief Length for Ifx_GETH_MMC_IPC_RX_INTERRUPT_Bits.RXUDPGOIS */
#define IFX_GETH_MMC_IPC_RX_INTERRUPT_RXUDPGOIS_LEN (1u)

/** \brief Mask for Ifx_GETH_MMC_IPC_RX_INTERRUPT_Bits.RXUDPGOIS */
#define IFX_GETH_MMC_IPC_RX_INTERRUPT_RXUDPGOIS_MSK (0x1u)

/** \brief Offset for Ifx_GETH_MMC_IPC_RX_INTERRUPT_Bits.RXUDPGOIS */
#define IFX_GETH_MMC_IPC_RX_INTERRUPT_RXUDPGOIS_OFF (24u)

/** \brief Length for Ifx_GETH_MMC_IPC_RX_INTERRUPT_Bits.RXUDPEROIS */
#define IFX_GETH_MMC_IPC_RX_INTERRUPT_RXUDPEROIS_LEN (1u)

